awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
/**
 * @file qspi_init.c
 * QUADSPI memory-mapped (XIP) init for Micron MT25TL01G — Bank 1, 64 MB.
 *
 * Adapted from STM32CubeH7 QSPI_MemoryMappedDual example for early boot init.
 * 
 * STM32H750B-DK dual-QSPI pin assignment (from UM2488 / board schematic):
 *   Signal   Pin   AF
 *   CLK      PF10  AF9
 *   NCS      PG6   AF10
 *   BK1_IO0  PD11  AF9
 *   BK1_IO1  PF9   AF10
 *   BK1_IO2  PF7   AF9
 *   BK1_IO3  PF6   AF9
 *   BK2_IO0  PH2   AF9
 *   BK2_IO1  PH3   AF9
 *   BK2_IO2  PG9   AF9
 *   BK2_IO3  PG14  AF9
 *
 * Read mode: Quad-IO Fast Read (0xEB, 1-4-4) — 1-line inst (8T), 4-line 32-bit addr (8T),
 * 8 dummy cycles, 4-line data.  Clock = AHB3 (200 MHz) / (1+1) = 100 MHz.
 * MT25TL01G is rated to 133 MHz; 100 MHz leaves margin for PCB parasitics.
 *
 * Per-burst overhead vs 0x6B (1-1-4, Quad Output Fast Read):
 *   0x6B: inst(1L,8T) + addr(1L,32T) + dummy(8T) = 48T total overhead
 *   0xEB: inst(1L,8T) + addr(4L, 8T) + dummy(8T) = 24T total overhead
 * 0xEB halves the overhead for every AHB burst, giving ~6× more throughput on
 * small/scattered reads (LVGL widget tree traversal, XIP code fetch misses).
 *
 * Dual-die 0xEB mode byte timing (empirical, important):
 * The datasheet defines a mode byte (M7-M0 = 0xF0) between address and dummy clocks
 * to signal continuous-read mode.  With STM32 ABMODE=4_LINES and ABSIZE=8_BITS in
 * dual-flash mode, the 8 IO pins (4 per die) transfer 8 bits in ONE clock instead
 * of the two clocks a single-die setup would use.  The flash therefore starts
 * outputting data 1 clock (= 2 bytes in dual 8-bit/clock mode) earlier than the
 * STM32 FIFO expects, producing a 2-byte offset on every read.
 *
 * Fix: AlternateByteMode=NONE, DummyCycles=8 (the VCR-configured value, unchanged).
 * With IO lines high-Z during the nominal mode-byte window the MT25TL01G absorbs
 * that clock phase as part of its internal output-enable delay, and the standard
 * 8 dummy cycles then align STM32 sampling to the first valid data edge.
 * (DummyCycles=10, i.e. +2 for the "missing" mode byte, was also tried but produced
 * the same 2-byte offset — the flash was already driving data before the extra
 * dummy window opened.)
 *
 * Measured bandwidth (100 MHz, dual-die, no D-/I-cache):
 *   Small reads  (4 KB):  ~16 MB/s  (was ~2.7 MB/s with 0x6B — 6× improvement)
 *   Large reads  (1 MB):  ~25 MB/s  (AHB/FIFO limit; identical for 0x6B and 0xEB)
 *   Cached reads (warm):  ~68 MB/s  (cache-hit dominated; same for both modes)
 */

#include "qspi_init.h"
#include "main.h"       /* Error_Handler() */
#include "app_log.h"
#include "stm32h7xx_hal.h"
#include <string.h>

/* ---- MT25TL01G command set (Micron, SPI-NOR compatible) ------------------- */
#define MT25_RESET_ENABLE_CMD         0x66U
#define MT25_RESET_MEM_CMD            0x99U
#define MT25_WRITE_ENABLE_CMD         0x06U
#define MT25_READ_STATUS_CMD          0x05U
#define MT25_READ_FLAG_STATUS_CMD     0x70U
#define MT25_ENTER_4BYTE_ADDR_CMD     0xB7U
#define MT25_READ_VOL_CFG_REG_CMD     0x85U  /* Volatile Config Register */
#define MT25_WRITE_VOL_CFG_REG_CMD    0x81U
#define MT25_READ_DATA_CMD            0x03U
#define MT25_SUBSECTOR_ERASE_CMD      0x20U
#define MT25_PAGE_PROGRAM_CMD         0x02U
#define MT25_QUAD_OUT_FAST_READ       0x6BU  /* 1-1-4: inst/addr on SIO0, data on 4 lines */
#define MT25_QUAD_IO_FAST_READ        0xEBU  /* 1-4-4: inst on 1 line, addr+data on 4 lines */
#define MT25_DUMMY_CYCLES             8U     /* VCR setting: real output-delay cycles for flash */

/*
 * Single die = 64 MB = 2^26 bytes -> FlashSize field 25.
 * Dual-flash interleaved window = 128 MB = 2^27 bytes -> FlashSize field 26.
 */
#define MT25_FLASH_SIZE_FIELD_SINGLE  25U
#define MT25_FLASH_SIZE_FIELD_DUAL    26U
#define QSPI_CLOCK_PRESCALER          1U   /* 200 MHz / 2 = 100 MHz (fallback only; QSPI_MemoryMapped_Init hardcodes prescaler=1) */
#define QSPI_KERNEL_CLOCK_HZ          200000000U

/* Volatile config register dummy cycles field (bits 7:4 for quad read) */
#define QSPI_VCR_DUMMY_CYCLES_MASK    0xF0U
#define QSPI_VCR_DUMMY_QUAD_SHIFT     4U

/* Destructive self-test region near top of 64MB bank to avoid app assets. */
#define QSPI_SELFTEST_ENABLE          1U
#define QSPI_SELFTEST_ADDR            0x03F00000U
#define QSPI_SELFTEST_SIZE            4096U
#define QSPI_PAGE_SIZE                256U
#define QSPI_RAMTEST_WORDS            512U
#define QSPI_SOAK_TEST_MS             1000U

typedef struct
{
    uint8_t prescaler;
    uint32_t sample_shifting;
    uint32_t cs_high_time;
    uint8_t dummy_cycles;
} QSPI_TuneConfig;

/* Handle is file-scope; no public API needed beyond the init function. */
static QSPI_HandleTypeDef hqspi;

static void QSPI_WriteEnable(void);
static void QSPI_WaitReady(void);
static void QSPI_DummyCyclesCfg(uint8_t dummy_cycles);
static void QSPI_SetFlashTarget(uint32_t flash_id, uint32_t dualflash);
static void QSPI_DumpQspiRegs(const char *tag);
static void QSPI_DumpCoreRegs(const char *tag);
static void QSPI_DumpFlashRegs(const char *tag);
static void QSPI_DumpMmWindow(const char *tag);
static int QSPI_TryReadRegs(uint8_t instruction, uint8_t *buf, uint8_t len);
static int QSPI_RunSelfTestAtCurrentSpeed(uint8_t dummy_cycles, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100);
static int QSPI_RunSelfTestForMs(uint8_t dummy_cycles, uint32_t duration_ms, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100);

static uint32_t qspi_ramtest_buf[QSPI_RAMTEST_WORDS];

/* ---- Helpers -------------------------------------------------------------- */

static void QSPI_GPIO_Init(void)
{
    GPIO_InitTypeDef g = {0};

    /* Peripheral + GPIO clocks */
    __HAL_RCC_QSPI_CLK_ENABLE();
    __HAL_RCC_QSPI_FORCE_RESET();
    __HAL_RCC_QSPI_RELEASE_RESET();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();

    g.Mode  = GPIO_MODE_AF_PP;
    g.Pull  = GPIO_NOPULL;
    g.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    /* CLK: PF10, AF9 */
    g.Pin = GPIO_PIN_10; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

