awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
    /* NCS: PG6, AF10 — pull-up keeps flash deselected when idle */
    g.Pin = GPIO_PIN_6; g.Pull = GPIO_PULLUP; g.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init(GPIOG, &g);
    g.Pull = GPIO_NOPULL;

    /* IO0: PD11, AF9 */
    g.Pin = GPIO_PIN_11; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOD, &g);

    /* IO1: PF9, AF10 */
    g.Pin = GPIO_PIN_9; g.Alternate = GPIO_AF10_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* IO2: PF7, AF9 */
    g.Pin = GPIO_PIN_7; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* BK1 IO3: PF6, AF9 */
    g.Pin = GPIO_PIN_6; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOF, &g);

    /* BK2 IO0: PH2, AF9 */
    g.Pin = GPIO_PIN_2; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOH, &g);

    /* BK2 IO1: PH3, AF9 */
    g.Pin = GPIO_PIN_3; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOH, &g);

    /* BK2 IO2: PG9, AF9 */
    g.Pin = GPIO_PIN_9; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOG, &g);

    /* BK2 IO3: PG14, AF9 */
    g.Pin = GPIO_PIN_14; g.Alternate = GPIO_AF9_QUADSPI;
    HAL_GPIO_Init(GPIOG, &g);
}

static void QSPI_SendCmd(uint8_t instruction)
{
    QSPI_CommandTypeDef cmd = {0};
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_NONE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

static uint8_t QSPI_ReadReg(uint8_t instruction)
{
    QSPI_CommandTypeDef cmd = {0};
    uint8_t reg = 0U;

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = 1U;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, &reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    return reg;
}

static void __attribute__((unused)) QSPI_ReadRegs(uint8_t instruction, uint8_t *buf, uint8_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    if (len == 0U || buf == NULL) {
        return;
    }

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, buf, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

static int QSPI_TryReadRegs(uint8_t instruction, uint8_t *buf, uint8_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    if (len == 0U || buf == NULL) {
        return 0;
    }

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = instruction;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return 0;
    }
    if (HAL_QSPI_Receive(&hqspi, buf, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        return 0;
    }
    return 1;
}

static void QSPI_LogRegs(const char *tag)
{
    uint8_t sr = QSPI_ReadReg(MT25_READ_STATUS_CMD);
    uint8_t vcr = QSPI_ReadReg(MT25_READ_VOL_CFG_REG_CMD);
    APP_LOGI("QSPI", "%s SR=0x%02x (WIP=%u WEL=%u) VCR=0x%02x",
             tag,
             (unsigned)sr,
             (unsigned)(sr & 0x01U),
             (unsigned)((sr >> 1) & 0x01U),
             (unsigned)vcr);
}

static void QSPI_DumpQspiRegs(const char *tag)
{
    APP_LOGI("QDBG", "%s QUADSPI CR=0x%08lx DCR=0x%08lx SR=0x%08lx FCR=0x%08lx",
             tag,
             (unsigned long)QUADSPI->CR,
             (unsigned long)QUADSPI->DCR,
             (unsigned long)QUADSPI->SR,
             (unsigned long)QUADSPI->FCR);
    APP_LOGI("QDBG", "%s QUADSPI DLR=0x%08lx CCR=0x%08lx AR=0x%08lx ABR=0x%08lx",
             tag,
             (unsigned long)QUADSPI->DLR,
             (unsigned long)QUADSPI->CCR,
             (unsigned long)QUADSPI->AR,
             (unsigned long)QUADSPI->ABR);
    APP_LOGI("QDBG", "%s QUADSPI PSMKR=0x%08lx PSMAR=0x%08lx PIR=0x%08lx LPTR=0x%08lx",
             tag,
             (unsigned long)QUADSPI->PSMKR,
             (unsigned long)QUADSPI->PSMAR,
             (unsigned long)QUADSPI->PIR,
             (unsigned long)QUADSPI->LPTR);
}

static void QSPI_DumpCoreRegs(const char *tag)
{
    APP_LOGI("QDBG", "%s SCB CCR=0x%08lx SHCSR=0x%08lx CFSR=0x%08lx HFSR=0x%08lx",
             tag,
             (unsigned long)SCB->CCR,
             (unsigned long)SCB->SHCSR,
             (unsigned long)SCB->CFSR,
             (unsigned long)SCB->HFSR);
    APP_LOGI("QDBG", "%s SCB BFAR=0x%08lx MMFAR=0x%08lx DFSR=0x%08lx AFSR=0x%08lx VTOR=0x%08lx",
             tag,
             (unsigned long)SCB->BFAR,
             (unsigned long)SCB->MMFAR,
             (unsigned long)SCB->DFSR,
             (unsigned long)SCB->AFSR,
             (unsigned long)SCB->VTOR);
}

