awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
static void QSPI_DumpFlashRegs(const char *tag)
{
    uint8_t sr[2] = {0U, 0U};
    uint8_t fsr[2] = {0U, 0U};
    uint8_t vcr[2] = {0U, 0U};
    uint8_t n = (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) ? 2U : 1U;

    if (!QSPI_TryReadRegs(MT25_READ_STATUS_CMD, sr, n) ||
        !QSPI_TryReadRegs(MT25_READ_FLAG_STATUS_CMD, fsr, n) ||
        !QSPI_TryReadRegs(MT25_READ_VOL_CFG_REG_CMD, vcr, n)) {
        APP_LOGI("QDBG", "%s FLASH reg read failed (non-fatal)", tag);
        return;
    }

    if (n == 2U) {
        APP_LOGI("QDBG", "%s FLASH SR=[%02x %02x] FSR=[%02x %02x] VCR=[%02x %02x]",
                 tag,
                 (unsigned)sr[0], (unsigned)sr[1],
                 (unsigned)fsr[0], (unsigned)fsr[1],
                 (unsigned)vcr[0], (unsigned)vcr[1]);
    } else {
        APP_LOGI("QDBG", "%s FLASH SR=0x%02x FSR=0x%02x VCR=0x%02x",
                 tag,
                 (unsigned)sr[0],
                 (unsigned)fsr[0],
                 (unsigned)vcr[0]);
    }
}

static void QSPI_DumpMmWindow(const char *tag)
{
    volatile uint8_t *p8 = (volatile uint8_t *)0x90000000U;
    volatile uint32_t *p32 = (volatile uint32_t *)0x90000000U;

    APP_LOGI("QDBG", "%s MM8  [0..15]=%02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x %02x",
             tag,
             (unsigned)p8[0], (unsigned)p8[1], (unsigned)p8[2], (unsigned)p8[3],
             (unsigned)p8[4], (unsigned)p8[5], (unsigned)p8[6], (unsigned)p8[7],
             (unsigned)p8[8], (unsigned)p8[9], (unsigned)p8[10], (unsigned)p8[11],
             (unsigned)p8[12], (unsigned)p8[13], (unsigned)p8[14], (unsigned)p8[15]);
    APP_LOGI("QDBG", "%s MM32 [0..3]=%08lx %08lx %08lx %08lx",
             tag,
             (unsigned long)p32[0],
             (unsigned long)p32[1],
             (unsigned long)p32[2],
             (unsigned long)p32[3]);
}

static uint32_t QSPI_CyclesPerSecond(void)
{
    uint32_t hz = SystemCoreClock;
    return (hz == 0U) ? 400000000U : hz;
}

static uint32_t QSPI_MBs_x100(uint32_t bytes, uint32_t cycles)
{
    uint64_t num;
    uint64_t den;

    if (cycles == 0U) {
        return 0U;
    }

    num = (uint64_t)bytes * (uint64_t)QSPI_CyclesPerSecond() * 100ULL;
    den = (uint64_t)cycles * 1024ULL * 1024ULL;
    return (uint32_t)(num / den);
}

static void QSPI_EnableMemoryMappedRead(uint8_t dummy_cycles)
{
    QSPI_CommandTypeDef cmd = {0};
    QSPI_MemoryMappedTypeDef mmap = {0};

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_QUAD_IO_FAST_READ;  /* 0xEB = 1-4-4 */
    cmd.AddressMode       = QSPI_ADDRESS_4_LINES;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_4_LINES;
    /* No alternate byte: dual-die absorbs the mode-byte window; VCR dummy cycles suffice. */
    cmd.DummyCycles       = dummy_cycles;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    mmap.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;

    if (HAL_QSPI_MemoryMapped(&hqspi, &cmd, &mmap) != HAL_OK) {
        Error_Handler();
    }
}

static void QSPI_DisableMemoryMappedRead(void)
{
    if (HAL_QSPI_Abort(&hqspi) != HAL_OK) {
        Error_Handler();
    }
}

static uint32_t QSPI_FreqMHz(uint32_t prescaler)
{
    return (QSPI_KERNEL_CLOCK_HZ / (prescaler + 1U)) / 1000000U;
}

static int QSPI_RunClassicRamTests(void)
{
    static const uint32_t patterns[] = {
        0x00000000U,
        0xFFFFFFFFU,
        0xAAAAAAAAU,
        0x55555555U,
        0x33333333U,
        0xCCCCCCCCU
    };
    uint32_t i;
    uint32_t p;

    APP_LOGI("RAM", "classic test start words=%lu", (unsigned long)QSPI_RAMTEST_WORDS);

    for (p = 0; p < (sizeof(patterns) / sizeof(patterns[0])); p++) {
        uint32_t pat = patterns[p];
        for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
            qspi_ramtest_buf[i] = pat;
        }
        for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
            if (qspi_ramtest_buf[i] != pat) {
                APP_LOGI("RAM", "pattern FAIL pat=0x%08lx idx=%lu got=0x%08lx",
                         (unsigned long)pat,
                         (unsigned long)i,
                         (unsigned long)qspi_ramtest_buf[i]);
                return 0;
            }
        }
    }

    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        qspi_ramtest_buf[i] = (1UL << (i & 31U));
    }
    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        uint32_t exp = (1UL << (i & 31U));
        if (qspi_ramtest_buf[i] != exp) {
            APP_LOGI("RAM", "walk1 FAIL idx=%lu exp=0x%08lx got=0x%08lx",
                     (unsigned long)i,
                     (unsigned long)exp,
                     (unsigned long)qspi_ramtest_buf[i]);
            return 0;
        }
    }

    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        qspi_ramtest_buf[i] = ~(1UL << (i & 31U));
    }
    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        uint32_t exp = ~(1UL << (i & 31U));
        if (qspi_ramtest_buf[i] != exp) {
            APP_LOGI("RAM", "walk0 FAIL idx=%lu exp=0x%08lx got=0x%08lx",
                     (unsigned long)i,
                     (unsigned long)exp,
                     (unsigned long)qspi_ramtest_buf[i]);
            return 0;
        }
    }

    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        qspi_ramtest_buf[i] = ((i * 0x9E3779B1U) ^ 0xA5A5A5A5U);
    }
    for (i = 0; i < QSPI_RAMTEST_WORDS; i++) {
        uint32_t exp = ((i * 0x9E3779B1U) ^ 0xA5A5A5A5U);
        if (qspi_ramtest_buf[i] != exp) {
            APP_LOGI("RAM", "addr/data FAIL idx=%lu exp=0x%08lx got=0x%08lx",
                     (unsigned long)i,
                     (unsigned long)exp,
                     (unsigned long)qspi_ramtest_buf[i]);
            return 0;
        }
    }

    APP_LOGI("RAM", "classic test PASS");
    return 1;
}

static void QSPI_InitPeripheral(const QSPI_TuneConfig *cfg)
{
    hqspi.Instance                = QUADSPI;
    hqspi.Init.ClockPrescaler     = cfg->prescaler;
    hqspi.Init.FifoThreshold      = 4U;
    hqspi.Init.SampleShifting     = cfg->sample_shifting;
    hqspi.Init.FlashSize          = MT25_FLASH_SIZE_FIELD_DUAL;
    hqspi.Init.ChipSelectHighTime = cfg->cs_high_time;
    hqspi.Init.ClockMode          = QSPI_CLOCK_MODE_0;
    hqspi.Init.FlashID            = QSPI_FLASH_ID_2;
    hqspi.Init.DualFlash          = QSPI_DUALFLASH_ENABLE;  /* STM32H750B-DK has dual QSPI NOR */

    HAL_QSPI_DeInit(&hqspi);
    if (HAL_QSPI_Init(&hqspi) != HAL_OK) {
        Error_Handler();
    }
}

