awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
static void QSPI_SetFlashTarget(uint32_t flash_id, uint32_t dualflash)
{
    hqspi.Init.FlashID = flash_id;
    hqspi.Init.DualFlash = dualflash;
    hqspi.Init.FlashSize = (dualflash == QSPI_DUALFLASH_ENABLE)
                           ? MT25_FLASH_SIZE_FIELD_DUAL
                           : MT25_FLASH_SIZE_FIELD_SINGLE;

    HAL_QSPI_DeInit(&hqspi);
    if (HAL_QSPI_Init(&hqspi) != HAL_OK) {
        /* Some stacks reject FLASH_ID_2 when DualFlash is enabled; retry FLASH_ID_1. */
        if ((dualflash == QSPI_DUALFLASH_ENABLE) && (flash_id == QSPI_FLASH_ID_2)) {
            APP_LOGI("QSPI", "dual init with FlashID=2 failed, retry FlashID=1");
            hqspi.Init.FlashID = QSPI_FLASH_ID_1;
            HAL_QSPI_DeInit(&hqspi);
            if (HAL_QSPI_Init(&hqspi) != HAL_OK) {
                Error_Handler();
            }
        } else {
            Error_Handler();
        }
    }

    APP_LOGI("QSPI", "target flash=%lu dual=%lu fsize=%lu",
             (unsigned long)hqspi.Init.FlashID,
             (unsigned long)hqspi.Init.DualFlash,
             (unsigned long)hqspi.Init.FlashSize);
}

static int QSPI_ConfigFlashForMemoryMapped(const QSPI_TuneConfig *cfg)
{
    /* ST QSPI_MemoryMappedDual sequence: keep dual enabled and configure once. */
    QSPI_SetFlashTarget(QSPI_FLASH_ID_2, QSPI_DUALFLASH_ENABLE);

    QSPI_SendCmd(MT25_RESET_ENABLE_CMD);
    QSPI_SendCmd(MT25_RESET_MEM_CMD);
    QSPI_WaitReady();

    QSPI_WriteEnable();
    QSPI_SendCmd(MT25_ENTER_4BYTE_ADDR_CMD);
    QSPI_WaitReady();

    QSPI_DummyCyclesCfg(cfg->dummy_cycles);
    return 1;
}

static void QSPI_Erase4K(uint32_t address)
{
    QSPI_CommandTypeDef cmd = {0};

    QSPI_WriteEnable();

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_SUBSECTOR_ERASE_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_1_LINE;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.Address           = address;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_NONE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    QSPI_WaitReady();
}

static void QSPI_ProgramPage(uint32_t address, const uint8_t *data, uint32_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    QSPI_WriteEnable();

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_PAGE_PROGRAM_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_1_LINE;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.Address           = address;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Transmit(&hqspi, (uint8_t *)data, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    QSPI_WaitReady();
}

static void QSPI_ReadData(uint32_t address, uint8_t *data, uint32_t len)
{
    QSPI_CommandTypeDef cmd = {0};

    /* Use 0xEB (Quad IO Fast Read) — same command as MM mode for apples-to-apples BW. */
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_QUAD_IO_FAST_READ;  /* 0xEB = 1-4-4 */
    cmd.AddressMode       = QSPI_ADDRESS_4_LINES;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.Address           = address;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_4_LINES;
    /* No alternate byte: dual-die absorbs the mode-byte window; VCR dummy cycles suffice. */
    cmd.DummyCycles       = MT25_DUMMY_CYCLES;
    cmd.NbData            = len;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, data, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

static int QSPI_RunSelfTestAtCurrentSpeed(uint8_t dummy_cycles, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100)
{
    static uint8_t tx[QSPI_SELFTEST_SIZE];
    static uint8_t rx[QSPI_SELFTEST_SIZE];
    uint32_t erase_cycles;
    uint32_t write_cycles;
    uint32_t read_cycles;
    uint32_t mm_read_cycles;
    uint32_t t0;
    uint32_t i;

    APP_LOGI("QSPI", "selftest start addr=0x%08lx size=%lu",
             (unsigned long)QSPI_SELFTEST_ADDR,
             (unsigned long)QSPI_SELFTEST_SIZE);

    for (i = 0; i < QSPI_SELFTEST_SIZE; i++) {
        tx[i] = (uint8_t)((i * 37U) ^ 0xA5U);
        rx[i] = 0U;
    }

    t0 = DWT->CYCCNT;
    QSPI_Erase4K(QSPI_SELFTEST_ADDR);
    erase_cycles = DWT->CYCCNT - t0;

    t0 = DWT->CYCCNT;
    for (i = 0; i < QSPI_SELFTEST_SIZE; i += QSPI_PAGE_SIZE) {
        QSPI_ProgramPage(QSPI_SELFTEST_ADDR + i, &tx[i], QSPI_PAGE_SIZE);
    }
    write_cycles = DWT->CYCCNT - t0;

    t0 = DWT->CYCCNT;
    QSPI_ReadData(QSPI_SELFTEST_ADDR, rx, QSPI_SELFTEST_SIZE);
    read_cycles = DWT->CYCCNT - t0;

    t0 = DWT->CYCCNT;
    QSPI_EnableMemoryMappedRead(dummy_cycles);
    {
        volatile uint32_t *mm = (volatile uint32_t *)(0x90000000U + QSPI_SELFTEST_ADDR);
        volatile uint32_t *dst = (volatile uint32_t *)(void *)rx;
        for (i = 0; i < QSPI_SELFTEST_SIZE / 4U; i++) {
            dst[i] = mm[i];
        }
    }
    mm_read_cycles = DWT->CYCCNT - t0;
    QSPI_DisableMemoryMappedRead();

    if (memcmp(tx, rx, QSPI_SELFTEST_SIZE) != 0) {
        APP_LOGI("QSPI", "selftest FAIL: MM verify mismatch");
        for (i = 0; i < QSPI_SELFTEST_SIZE; i++) {
            if (tx[i] != rx[i]) {
                APP_LOGI("QSPI", "mismatch @+0x%04lx exp=0x%02x got=0x%02x",
                         (unsigned long)i,
                         (unsigned)tx[i],
                         (unsigned)rx[i]);
                break;
            }
        }
        return 0;
    }

    APP_LOGI("QSPI", "selftest PASS erase=%lu cyc write=%lu cyc read=%lu cyc",
             (unsigned long)erase_cycles,
             (unsigned long)write_cycles,
             (unsigned long)read_cycles);
    *write_mbs_x100 = QSPI_MBs_x100(QSPI_SELFTEST_SIZE, write_cycles);
    *read_mbs_x100 = QSPI_MBs_x100(QSPI_SELFTEST_SIZE, mm_read_cycles);

    APP_LOGI("QSPI", "selftest BW write=%lu.%02lu MB/s read(indirect)=%lu.%02lu MB/s read(mm)=%lu.%02lu MB/s",
             (unsigned long)(*write_mbs_x100 / 100U),
             (unsigned long)(*write_mbs_x100 % 100U),
             (unsigned long)(QSPI_MBs_x100(QSPI_SELFTEST_SIZE, read_cycles) / 100U),
             (unsigned long)(QSPI_MBs_x100(QSPI_SELFTEST_SIZE, read_cycles) % 100U),
             (unsigned long)(*read_mbs_x100 / 100U),
             (unsigned long)(*read_mbs_x100 % 100U));
    return 1;
}

static int QSPI_VerifyMemoryMappedRead(uint8_t dummy_cycles)
{
    volatile uint32_t w0, w1, w2, w3;
    
