awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
    QSPI_EnableMemoryMappedRead(dummy_cycles);
    __DSB();
    __ISB();
    
    w0 = *(volatile uint32_t *)(0x90000000U);
    w1 = *(volatile uint32_t *)(0x90000004U);
    w2 = *(volatile uint32_t *)(0x90000008U);
    w3 = *(volatile uint32_t *)(0x9000000CU);
    
    QSPI_DisableMemoryMappedRead();
    
    APP_LOGI("QSPI", "mm_verify words: 0x%08lx 0x%08lx 0x%08lx 0x%08lx",
             (unsigned long)w0,
             (unsigned long)w1,
             (unsigned long)w2,
             (unsigned long)w3);
    
    return 1;
}

static int QSPI_RunSelfTestForMs(uint8_t dummy_cycles, uint32_t duration_ms, uint32_t *write_mbs_x100, uint32_t *read_mbs_x100)
{
    uint32_t start = DWT->CYCCNT;
    uint32_t target_cycles = (QSPI_CyclesPerSecond() / 1000U) * duration_ms;
    uint32_t loops = 0U;
    uint32_t write_bw = 0U;
    uint32_t read_bw = 0U;

    if (target_cycles == 0U) {
        target_cycles = 1U;
    }

    do {
        loops++;
        if (!QSPI_RunSelfTestAtCurrentSpeed(dummy_cycles, &write_bw, &read_bw)) {
            APP_LOGI("QSPI", "soak FAIL loop=%lu", (unsigned long)loops);
            return 0;
        }
        APP_LOGI("QSPI", "soak loop=%lu write=%lu.%02lu read=%lu.%02lu MB/s",
                 (unsigned long)loops,
                 (unsigned long)(write_bw / 100U),
                 (unsigned long)(write_bw % 100U),
                 (unsigned long)(read_bw / 100U),
                 (unsigned long)(read_bw % 100U));
    } while ((DWT->CYCCNT - start) < target_cycles);

    *write_mbs_x100 = write_bw;
    *read_mbs_x100 = read_bw;
    APP_LOGI("QSPI", "soak PASS duration=%lums loops=%lu",
             (unsigned long)duration_ms,
             (unsigned long)loops);
    return 1;
}

static uint32_t QSPI_BenchmarkMmRead_x100(uint32_t size_bytes, uint32_t passes)
{
    volatile uint32_t *p32 = (volatile uint32_t *)0x90000000U;
    uint32_t words = size_bytes / 4U;
    uint32_t p;
    uint32_t i;
    uint32_t t0;
    uint32_t cycles;
    volatile uint32_t sink = 0U;

    if (words == 0U || passes == 0U) {
        return 0U;
    }

    __DSB();
    __ISB();
    t0 = DWT->CYCCNT;
    for (p = 0U; p < passes; p++) {
        for (i = 0U; i < words; i++) {
            sink ^= p32[i];
        }
    }
    cycles = DWT->CYCCNT - t0;
    APP_LOGI("QBENCH", "mm-read checksum=0x%08lx size=%lu passes=%lu cycles=%lu",
             (unsigned long)sink,
             (unsigned long)size_bytes,
             (unsigned long)passes,
             (unsigned long)cycles);

    return QSPI_MBs_x100(size_bytes * passes, cycles);
}

static QSPI_TuneConfig __attribute__((unused)) QSPI_FindFastestStableConfig(void)
{
    static const uint8_t prescalers[] = {1U, 2U, 3U, 4U, 5U};
    static const uint32_t sample_modes[] = {
        QSPI_SAMPLE_SHIFTING_HALFCYCLE,
        QSPI_SAMPLE_SHIFTING_NONE
    };
    static const uint32_t cs_times[] = {
        QSPI_CS_HIGH_TIME_6_CYCLE,
        QSPI_CS_HIGH_TIME_3_CYCLE,
        QSPI_CS_HIGH_TIME_2_CYCLE
    };
    static const uint8_t dummy_cycles[] = {10U, 8U, 6U};

    uint32_t pi;
    uint32_t si;
    uint32_t ci;
    uint32_t di;
    uint32_t write_bw = 0U;
    uint32_t read_bw = 0U;
    QSPI_TuneConfig cfg;

    for (pi = 0U; pi < (sizeof(prescalers) / sizeof(prescalers[0])); pi++) {
        cfg.prescaler = prescalers[pi];

        for (si = 0U; si < (sizeof(sample_modes) / sizeof(sample_modes[0])); si++) {
            cfg.sample_shifting = sample_modes[si];

            for (ci = 0U; ci < (sizeof(cs_times) / sizeof(cs_times[0])); ci++) {
                cfg.cs_high_time = cs_times[ci];

                for (di = 0U; di < (sizeof(dummy_cycles) / sizeof(dummy_cycles[0])); di++) {
                    cfg.dummy_cycles = dummy_cycles[di];

                    APP_LOGI("QSPI", "probe cfg p=%lu %luMHz sample=%s cs=%lu dummy=%lu",
                             (unsigned long)cfg.prescaler,
                             (unsigned long)QSPI_FreqMHz(cfg.prescaler),
                             (cfg.sample_shifting == QSPI_SAMPLE_SHIFTING_HALFCYCLE) ? "half" : "none",
                             (unsigned long)cfg.cs_high_time,
                             (unsigned long)cfg.dummy_cycles);

                    QSPI_InitPeripheral(&cfg);
                    QSPI_LogRegs("after HAL_QSPI_Init");

                    if (!QSPI_ConfigFlashForMemoryMapped(&cfg)) {
                        APP_LOGI("QSPI", "probe FAIL (flash cfg)");
                        continue;
                    }

                    QSPI_LogRegs("post-dummycfg");
                    
                    if (!QSPI_VerifyMemoryMappedRead(cfg.dummy_cycles)) {
                        APP_LOGI("QSPI", "probe FAIL (mm verify)");
                        continue;
                    }
                    
                    if (QSPI_RunSelfTestForMs(cfg.dummy_cycles, QSPI_SOAK_TEST_MS, &write_bw, &read_bw)) {
                        APP_LOGI("QSPI", "probe PASS p=%lu %luMHz sample=%s cs=%lu dummy=%lu write=%lu.%02lu read=%lu.%02lu MB/s",
                                 (unsigned long)cfg.prescaler,
                                 (unsigned long)QSPI_FreqMHz(cfg.prescaler),
                                 (cfg.sample_shifting == QSPI_SAMPLE_SHIFTING_HALFCYCLE) ? "half" : "none",
                                 (unsigned long)cfg.cs_high_time,
                                 (unsigned long)cfg.dummy_cycles,
                                 (unsigned long)(write_bw / 100U),
                                 (unsigned long)(write_bw % 100U),
                                 (unsigned long)(read_bw / 100U),
                                 (unsigned long)(read_bw % 100U));
                        return cfg;
                    }

                    APP_LOGI("QSPI", "probe FAIL p=%lu %luMHz sample=%s cs=%lu dummy=%lu",
                             (unsigned long)cfg.prescaler,
                             (unsigned long)QSPI_FreqMHz(cfg.prescaler),
                             (cfg.sample_shifting == QSPI_SAMPLE_SHIFTING_HALFCYCLE) ? "half" : "none",
                             (unsigned long)cfg.cs_high_time,
                             (unsigned long)cfg.dummy_cycles);
                }
            }
        }
    }

    APP_LOGI("QSPI", "probe FAILED all matrix candidates");
    Error_Handler();
    cfg.prescaler = QSPI_CLOCK_PRESCALER;
    cfg.sample_shifting = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
    cfg.cs_high_time = QSPI_CS_HIGH_TIME_3_CYCLE;
    cfg.dummy_cycles = MT25_DUMMY_CYCLES;
    return cfg;
}

/**
 * QSPI_WriteEnable — Send write enable command, poll status for WEL bit
 */
static void QSPI_WriteEnable(void)
{
    QSPI_CommandTypeDef     cmd = {0};
    QSPI_AutoPollingTypeDef cfg = {0};
    uint32_t status_mask;
    uint32_t status_match;
    uint32_t status_bytes;

    /* Send WRITE_ENABLE (0x06) */
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_WRITE_ENABLE_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_NONE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    /* In dual mode, poll both status bytes like ST QSPI_MemoryMappedDual example. */
    if (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) {
        status_mask = 0x0202U;
        status_match = 0x0202U;
        status_bytes = 2U;
    } else {
        status_mask = 0x02U;
        status_match = 0x02U;
        status_bytes = 1U;
    }

    cfg.Match           = status_match;
    cfg.Mask            = status_mask;
    cfg.MatchMode       = QSPI_MATCH_MODE_AND;
    cfg.StatusBytesSize = status_bytes;
    cfg.Interval        = 0x10U;
    cfg.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

    cmd.Instruction     = MT25_READ_STATUS_CMD;
    cmd.DataMode        = QSPI_DATA_1_LINE;

