awto-au/stm32_tests/stm32h750b-dk-mb1381/hal-freertos-lvgl/Src/qspi_init.c
    if (HAL_QSPI_AutoPolling(&hqspi, &cmd, &cfg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

/**
 * QSPI_WaitReady — Poll status register until WIP bit clears (memory ready)
 */
static void QSPI_WaitReady(void)
{
    QSPI_CommandTypeDef     cmd = {0};
    QSPI_AutoPollingTypeDef cfg = {0};
    uint32_t status_mask;
    uint32_t status_bytes;

    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_READ_STATUS_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    /* In dual mode, wait for both flashes ready like ST QSPI_MemoryMappedDual example. */
    if (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) {
        status_mask = 0x0101U;
        status_bytes = 2U;
    } else {
        status_mask = 0x01U;
        status_bytes = 1U;
    }

    cfg.Match           = 0x00U;  /* WIP bit 0 = 0 when ready */
    cfg.Mask            = status_mask;
    cfg.MatchMode       = QSPI_MATCH_MODE_AND;
    cfg.StatusBytesSize = status_bytes;
    cfg.Interval        = 0x10U;
    cfg.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

    if (HAL_QSPI_AutoPolling(&hqspi, &cmd, &cfg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
}

/**
 * QSPI_DummyCyclesCfg — Read and update volatile config register dummy cycles
 * ST reference: configures dummy cycles in memory's volatile register
 */
static void QSPI_DummyCyclesCfg(uint8_t dummy_cycles)
{
    QSPI_CommandTypeDef cmd = {0};
    uint16_t reg = 0;
    uint8_t reg_size = (hqspi.Init.DualFlash == QSPI_DUALFLASH_ENABLE) ? 2U : 1U;

    /* Read Volatile Config Register (0x85) */
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_READ_VOL_CFG_REG_CMD;
    cmd.AddressMode       = QSPI_ADDRESS_NONE;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_1_LINE;
    cmd.DummyCycles       = 0;  /* No dummy for initial read */
    cmd.NbData            = reg_size;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_QSPI_Receive(&hqspi, (uint8_t *)&reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    if (reg_size == 2U) {
        /* ST dual example updates both register bytes (mask 0xF0F0). */
        reg = (uint16_t)((reg & (uint16_t)~0xF0F0U) |
                         ((uint16_t)dummy_cycles << 4) |
                         ((uint16_t)dummy_cycles << 12));
    } else {
        reg = (uint16_t)((reg & (uint16_t)~QSPI_VCR_DUMMY_CYCLES_MASK) |
                         ((uint16_t)dummy_cycles << QSPI_VCR_DUMMY_QUAD_SHIFT));
    }

    /* Write-enable, then write updated VCR */
    QSPI_WriteEnable();

    cmd.Instruction = MT25_WRITE_VOL_CFG_REG_CMD;
    if (HAL_QSPI_Command(&hqspi, &cmd, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }
    cmd.NbData = reg_size;
    if (HAL_QSPI_Transmit(&hqspi, (uint8_t *)&reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        Error_Handler();
    }

    QSPI_WaitReady();
}

/*
 * Configure MPU region for the QSPI window.
 *
 * The QSPI flash is NOR (byte-addressable, read-only from the CPU perspective).
 * Start with non-cacheable/non-bufferable (like ST BSP data-only example) to rule
 * out cache coherence issues with instruction fetch.
 */
static void MPU_ConfigQSPI(void)
{
    MPU_Region_InitTypeDef r = {0};

    HAL_MPU_Disable();

    r.Enable           = MPU_REGION_ENABLE;
    r.Number           = MPU_REGION_NUMBER0;
    r.BaseAddress      = 0x90000000U;
    r.Size             = MPU_REGION_SIZE_256MB;   /* cover full AXI QSPI window */
    r.SubRegionDisable = 0x00U;
    /* Normal memory, WT/no-WA (TEX=0 C=1 B=0): I/D cache both active for XIP.
     * Read-only NOR flash — write-back unnecessary, WT avoids coherency risk. */
    r.TypeExtField     = MPU_TEX_LEVEL0;
    r.AccessPermission = MPU_REGION_PRIV_RO_URO;  /* read-only: no accidental write */
    r.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;
    r.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
    r.IsCacheable      = MPU_ACCESS_CACHEABLE;
    r.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
    HAL_MPU_ConfigRegion(&r);

    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/* ---- Public API ----------------------------------------------------------- */

void QSPI_MemoryMapped_Init(void)
{
    QSPI_CommandTypeDef      cmd  = {0};
    QSPI_MemoryMappedTypeDef mmap = {0};
    QSPI_TuneConfig cfg;

    APP_LOGI("QSPI", "configure mpu + gpio");
    MPU_ConfigQSPI();
    QSPI_GPIO_Init();
    APP_LOGI("QSPI", "gpio configured: CLK=PF10 NCS=PG6 BK1[PD11 PF9 PF7 PF6] BK2[PH2 PH3 PG9 PG14]");
    QSPI_DumpCoreRegs("post-mpu-gpio");
    QSPI_DumpQspiRegs("post-mpu-gpio");

    if (!QSPI_RunClassicRamTests()) {
        APP_LOGI("RAM", "classic test FAILED");
        Error_Handler();
    }

    /* ST QSPI_MemoryMappedDual baseline first, optimize only after pass */
    APP_LOGI("QSPI", "using ST baseline config");
    cfg.prescaler         = 1U;   /* 200 MHz / (1+1) = 100 MHz */
    cfg.sample_shifting   = QSPI_SAMPLE_SHIFTING_HALFCYCLE;
    cfg.cs_high_time      = QSPI_CS_HIGH_TIME_3_CYCLE;
    cfg.dummy_cycles      = MT25_DUMMY_CYCLES;

    QSPI_InitPeripheral(&cfg);
    QSPI_LogRegs("after HAL_QSPI_Init");
    QSPI_DumpQspiRegs("after-hal-init");
    QSPI_DumpFlashRegs("after-hal-init");

    if (!QSPI_ConfigFlashForMemoryMapped(&cfg)) {
        APP_LOGI("QSPI", "FAIL: flash config");
        Error_Handler();
    }
    QSPI_DumpQspiRegs("after-flash-config");
    QSPI_DumpFlashRegs("after-flash-config");

    /* Disable both caches for first proof (per doc section D) */
    APP_LOGI("QSPI", "disable I-cache and D-cache for first proof");
    SCB_DisableICache();
    SCB_DisableDCache();
    __DSB();
    __ISB();

    /* Enable memory-mapped mode using 0xEB (1-4-4 Quad IO Fast Read) */
    cmd.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    cmd.Instruction       = MT25_QUAD_IO_FAST_READ;  /* 0xEB = 1-4-4 */
    cmd.AddressMode       = QSPI_ADDRESS_4_LINES;
    cmd.AddressSize       = QSPI_ADDRESS_32_BITS;
    cmd.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    cmd.DataMode          = QSPI_DATA_4_LINES;
    /* No alternate byte: dual-die absorbs the mode-byte window; VCR dummy cycles suffice. */
    cmd.DummyCycles       = cfg.dummy_cycles;
    cmd.DdrMode           = QSPI_DDR_MODE_DISABLE;
    cmd.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    cmd.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    mmap.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;
    APP_LOGI("QSPI", "enable MM cmd=0x%02x (0xEB=1-4-4) addr4lines dummy=%u (no AB: MT25 dual-die absorbs mode byte)",
             (unsigned)cmd.Instruction,
             (unsigned)cfg.dummy_cycles);
    QSPI_DumpQspiRegs("before-mm-enable");
    QSPI_DumpCoreRegs("before-mm-enable");

    if (HAL_QSPI_MemoryMapped(&hqspi, &cmd, &mmap) != HAL_OK) {
        Error_Handler();
    }
    __DSB();
    __ISB();
    APP_LOGI("QSPI", "memory-mapped mode enabled @0x90000000 (caches OFF for proof)");
    QSPI_DumpQspiRegs("after-mm-enable");
    QSPI_DumpCoreRegs("after-mm-enable");
    QSPI_DumpMmWindow("after-mm-enable");

    /* Memory-mapped verification before XIP call (doc section B) */
    APP_LOGI("QSPI", "--- MM verification phase ---");
    volatile uint8_t *p8 = (volatile uint8_t *)0x90000000;
    volatile uint32_t *p32 = (volatile uint32_t *)0x90000000;

    /* Byte reads */
    APP_LOGI("QSPI", "byte reads [0-7]: %02x %02x %02x %02x %02x %02x %02x %02x",
             (unsigned)p8[0], (unsigned)p8[1], (unsigned)p8[2], (unsigned)p8[3],
             (unsigned)p8[4], (unsigned)p8[5], (unsigned)p8[6], (unsigned)p8[7]);

    /* Word reads */
    uint32_t w0 = p32[0];
    uint32_t w1 = p32[1];
    uint32_t w2 = p32[2];
    uint32_t w3 = p32[3];
    APP_LOGI("QSPI", "word reads [0-3]: %08lx %08lx %08lx %08lx",
             (unsigned long)w0, (unsigned long)w1, (unsigned long)w2, (unsigned long)w3);
    QSPI_DumpQspiRegs("mm-verify");
    QSPI_DumpCoreRegs("mm-verify");

    /* Repeated reads (stability check) */
    uint32_t wr0 = p32[0];
    uint32_t wr1 = p32[1];
    if (wr0 != w0 || wr1 != w1) {
        APP_LOGI("QSPI", "UNSTABLE: repeated reads differ! %08lx vs %08lx",
                 (unsigned long)wr0, (unsigned long)w0);
    } else {
        APP_LOGI("QSPI", "stable: repeated reads match");
    }

    /* Expected for XIP asm (movs r0,#42; bx lr) at 0x90000000 */
    APP_LOGI("QSPI", "XIP asm expected first word: 0x4770202a (little-endian) or 0x202a4770");
    if (w0 == 0x4770202aU || w0 == 0x202a4770U) {
        APP_LOGI("QSPI", "XIP first word looks correct!");
    } else {
        APP_LOGI("QSPI", "WARNING: XIP first word unexpected (may still work)");
    }
}

void QSPI_RunAggressiveBenchmark(void)
{
    uint32_t write_bw_x100 = 0U;
    uint32_t read_bw_x100 = 0U;
    uint32_t mm64k_x100;
    uint32_t mm1m_x100;
    HAL_StatusTypeDef st;

    APP_LOGI("QBENCH", "aggressive benchmark start");

    /* Leave global memory-mapped mode before issuing indirect erase/program commands. */
    st = HAL_QSPI_Abort(&hqspi);
    APP_LOGI("QBENCH", "leave-MM abort status=%ld sr=0x%08lx",
             (long)st,
             (unsigned long)QUADSPI->SR);

    /* Keep this destructive soak in the reserved self-test region only. */
    if (!QSPI_RunSelfTestForMs(MT25_DUMMY_CYCLES, 3000U, &write_bw_x100, &read_bw_x100)) {
        APP_LOGI("QBENCH", "soak FAIL");
        Error_Handler();
    }

    /* Self-test leaves MM mode disabled; re-enable before raw MM read benchmarks. */
    QSPI_EnableMemoryMappedRead(MT25_DUMMY_CYCLES);
    __DSB();
    __ISB();
    APP_LOGI("QBENCH", "MM mode enabled for read benchmarks");

    mm64k_x100 = QSPI_BenchmarkMmRead_x100(64U * 1024U, 32U);
    mm1m_x100 = QSPI_BenchmarkMmRead_x100(1024U * 1024U, 8U);

    APP_LOGI("QBENCH", "summary soak-write=%lu.%02lu MB/s soak-mm-read=%lu.%02lu MB/s",
             (unsigned long)(write_bw_x100 / 100U),
             (unsigned long)(write_bw_x100 % 100U),
             (unsigned long)(read_bw_x100 / 100U),
             (unsigned long)(read_bw_x100 % 100U));
    APP_LOGI("QBENCH", "summary mm-64k=%lu.%02lu MB/s mm-1m=%lu.%02lu MB/s",
             (unsigned long)(mm64k_x100 / 100U),
             (unsigned long)(mm64k_x100 % 100U),
             (unsigned long)(mm1m_x100 / 100U),
             (unsigned long)(mm1m_x100 % 100U));

    /* Keep MM mode enabled for subsequent XIP/LVGL flow. */
    APP_LOGI("QBENCH", "MM mode retained after benchmark");

    APP_LOGI("QBENCH", "aggressive benchmark PASS");
}

void QSPI_BenchmarkCachedRead(void)
{
    uint32_t mm64k_x100;
    uint32_t mm1m_x100;

    /* Must be called while QSPI is in memory-mapped mode and caches are ON. */
    __DSB();
    __ISB();
    mm64k_x100 = QSPI_BenchmarkMmRead_x100(64U * 1024U, 32U);
    mm1m_x100  = QSPI_BenchmarkMmRead_x100(1024U * 1024U, 8U);

    APP_LOGI("QBENCH", "cached mm-64k=%lu.%02lu MB/s mm-1m=%lu.%02lu MB/s",
             (unsigned long)(mm64k_x100 / 100U),
             (unsigned long)(mm64k_x100 % 100U),
             (unsigned long)(mm1m_x100 / 100U),
             (unsigned long)(mm1m_x100 % 100U));
}

